# JOIN

In [1]:
import pandas as pd

In [2]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"c":[3,4,5], "d":[11,12,13]})
v1.join(v2)

   A  b  c   d
0  1  2  3  11
1  2  3  4  12
2  3  4  5  13

In [3]:
v2.join(v1)

   c   d  A  b
0  3  11  1  2
1  4  12  2  3
2  5  13  3  4

In [5]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]}, index=['x','y','z'])
v2=pd.DataFrame({"c":[3,4,5], "d":[11,12,13]} )
v1.join(v2)

   A  b   c   d
x  1  2 NaN NaN
y  2  3 NaN NaN
z  3  4 NaN NaN

In [8]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]}, index=['x','y','z'])
v2=pd.DataFrame({"c":[3,4,5], "d":[11,12,13]}, index=['x','y','z'] )
v1.join(v2)

   A  b  c   d
x  1  2  3  11
y  2  3  4  12
z  3  4  5  13

In [10]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"c":[3], "d":[11]} )
v1.join(v2)

   A  b    c     d
0  1  2  3.0  11.0
1  2  3  NaN   NaN
2  3  4  NaN   NaN

In [12]:
v1.join(v2,how='right')

   A  b  c   d
0  1  2  3  11

In [13]:
v1.join(v2,how='left')

   A  b    c     d
0  1  2  3.0  11.0
1  2  3  NaN   NaN
2  3  4  NaN   NaN

In [14]:
v2.join(v1,how='right')

     c     d  A  b
0  3.0  11.0  1  2
1  NaN   NaN  2  3
2  NaN   NaN  3  4

In [16]:
v1.join(v2,how='outer')

   A  b    c     d
0  1  2  3.0  11.0
1  2  3  NaN   NaN
2  3  4  NaN   NaN

In [17]:
v1.join(v2,how='inner')

   A  b  c   d
0  1  2  3  11

In [22]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"c":[1,2,3], "b1":[2,3,4]} )
v1.join(v2)

   A  b  c  b1
0  1  2  1   2
1  2  3  2   3
2  3  4  3   4

In [26]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]} )
v1.join(v2,how="outer",lsuffix=12 , rsuffix= 1)

   A12  b12  A1  b1
0    1    2   1   2
1    2    3   2   3
2    3    4   3   4

# APPEND

In [28]:
v1.append(v2)

C:\Users\user\AppData\Local\Temp\ipykernel_14100\2961428189.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  v1.append(v2)

   A  b
0  1  2
1  2  3
2  3  4
0  1  2
1  2  3
2  3  4

In [30]:
v1.append(v2,ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_14100\2831856978.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  v1.append(v2,ignore_index=True)

   A  b
0  1  2
1  2  3
2  3  4
3  1  2
4  2  3
5  3  4

In [31]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"c":[1,2,3], "b":[2,3,4]} )

In [32]:
v1.append(v2,ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_14100\2831856978.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  v1.append(v2,ignore_index=True)

     A  b    c
0  1.0  2  NaN
1  2.0  3  NaN
2  3.0  4  NaN
3  NaN  2  1.0
4  NaN  3  2.0
5  NaN  4  3.0

In [34]:
v1=pd.DataFrame({"A":[1,2,3], "b":[2,3,4]})
v2=pd.DataFrame({"c":[1,2], "b":[2,3]} )
v1.append(v2,ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_14100\3394708531.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  v1.append(v2,ignore_index=True)

     A  b    c
0  1.0  2  NaN
1  2.0  3  NaN
2  3.0  4  NaN
3  NaN  2  1.0
4  NaN  3  2.0